app/views/events/show.html.erb

<!--コメント表示領域-->
            <% @event.event_comments.each do |event_comment| %>
---
SELECT "event_comments".* FROM "event_comments" WHERE "event_comments"."event_id" = ?  [["event_id", 3]]

                <% end %>
                <%= @event.likes.count %> いいね
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."event_id" = ?  [["event_id", 2]]

              <i class="far fa-comments" style="color: black;"></i>
              <%= @event.event_comments.count %>コメント
---
SELECT COUNT(*) FROM "event_comments" WHERE "event_comments"."event_id" = ?  [["event_id", 3]]