app/controllers/events_controller.rb

SELECT "events".* FROM "events"
SELECT COUNT(*) FROM "events"
---
  def index
    @events = Event.all
    @new_events  = Event.page(params[:page]).per(8)

INSERT INTO "events" ("user_id", "event_name", "game_location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["event_name", "a"], ["game_location", ""], ["created_at", "2020-11-10 09:52:34.539147"], ["updated_at", "2020-11-10 09:52:34.539147"]]
---
  def create
    @event = Event.new(event_params)
    @event.user_id = current_user.id
    @event.save

UPDATE "events" SET "event_name" = ?, "event_data" = ?, "ending_time" = ?, "game_location" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["event_name", "ボンバーマン"], ["event_data", "2020-11-16 15:00:00"], ["ending_time", "2020-11-09 14:41:00"], ["game_location", "初心者歓迎"], ["updated_at", "2020-11-09 10:27:20.694712"], ["id", 1]]
---
  def update
    @event.update(event_params)