app/controllers/event_comments_controller.rb

  def create
    # イベントのID取得
    event = Event.find(params[:event_id])
    @event_comments = event.event_comments
    # コメントしたユーザーのIDとコメント内容を取得
    comment = current_user.event_comments.new(event_comment_params)
    # イベントIDを代入※空のインスタンスを作成した後に行う
    comment.event_id = event.id
    comment.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "event_comments" ("comment", "user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["user_id", 1], ["event_id", 3], ["created_at", "2020-11-10 06:06:05.098807"], ["updated_at", "2020-11-10 06:06:05.098807"]]

  def destroy
    # 削除対象→どのイベントのどのコメントか
    # コメントのIDとイベントのIDを取得
    event = Event.find(params[:event_id])
    @event_comments = event.event_comments
    @event_comment = EventComment.find_by(id: params[:id], event_id: params[:event_id])
    @event_comment.destroy
---
SELECT  "event_comments".* FROM "event_comments" WHERE "event_comments"."id" = ? AND "event_comments"."event_id" = ? LIMIT ?  [["id", 3], ["event_id", 2], ["LIMIT", 1]]
DELETE FROM "event_comments" WHERE "event_comments"."id" = ?  [["id", 3]]