app/controllers/likes_controller.rb

  def create
    event = Event.find(params[:event_id])
    like = Like.new(event_id: event.id)
    like.user_id = current_user.id
    like.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["event_id", 2], ["created_at", "2020-11-10 07:29:55.071744"], ["updated_at", "2020-11-10 07:29:55.071744"]]

  def destroy
    # like = Like.find_by(id: params[:id], event_id: params[:event_id])
    event = Event.find(params[:event_id])
    like = current_user.likes.find_by(event_id: event.id)
    like.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."event_id" = ? LIMIT ?  [["user_id", 1], ["event_id", 2], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]