app/controllers/users_controller.rb

UPDATE "users" SET "sex" = ?, "age" = ?, "favorite_game" = ?, "introduction" = ?, "twitter" = ?, "youtube" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["sex", 1], ["age", 25], ["favorite_game", "スプラトゥーン"], ["introduction", "よろしくお願いします。"], ["twitter", "aaaa"], ["youtube", "aaa"], ["updated_at", "2020-11-08 11:18:52.599117"], ["id", 1]]
---
  def update
    if @user.update(user_params)